{
    "title": "string", // Title of the appointment or visit, e.g., "Annual Checkup", "Follow-up for Blood Pressure"
    "doctor_name": "string",
    "location": "string",
    "date": "string", // Date of the appointment in ISO format (YYYY-MM-DD)
    "summary": "string", // Short summary of the visit, including key points from the reason for visit, doctor's diagnosis, solution and todos.
    /* Reason for visit as provided by the patient. Don't invent and deviate from the actual reason for visit provided by the patient.  */
    "reason_for_visit": [
        {
            "reason": "string", // Reason for visit as provided by the patient, e.g., "Routine checkup", "High blood pressure", "Follow-up on lab results"
            "description": "string" // Additional details about the reason for visit, e.g., "Daily headaches and dissiness for the past week", "Blood pressure readings consistently above 140/90"
        }
    ],
    /* Diagnosis given by the doctor of the problem. Don't invent and deviate from the actual diagnosis provided by the doctor. */
    "diagnosis": {
        "details": [
            {
                "title": "string", // Title of the diagnosis, e.g., "Hypertension", "Type 2 Diabetes" 
                "description": "string", // Description and explaination for diagnosis
                "severity": "high | medium | low" // As labelled by the doctor. Unless doctor labels the severity, leave it out. Do not invent or assume severity level. E.g. if doctor says "Your blood pressure is a bit high, but we can manage it with lifestyle changes and medication", you can label it as "medium". But if doctor doesn't provide any indication of severity, leave it out.
            }
        ]
    },
    /* Todos are action items for the patient. Don't invent and deviate from the actual todos provided by the doctor.  */
    // Todos can be of type "Tests", "Medication", "Procedure", "Care", "Lifestyle Change" - ONLY.
    // If there is any relation between tools, mention that. E.g. if the doctor recommends getting a fasting cholesterol level test done at the lab, and based on the results, may recommend starting a cholesterol medication, you can mention that relation in the description of the respective todos. But do not invent any relation that is not explicitly mentioned by the doctor.
    "todos": [
        { 
            // Sample for type test. Group tests that belong together. Eg, Vitamin D and B12 test can be grouped together as they are both vitamin tests
            "type": "string",
            "title": "string", // Title of the TEST todo, e.g. "Cholesterol level Test", "Vitamin D and B12", "Immunity Tests (COVID-19, Flu, Strep)"
            "description": "string", // Description of the TEST todo, e.g. "Get fasting cholesterol level test done at the lab", "Get Vitamin D and B12 levels checked", "Get tested for COVID-19, Flu and Strep as experiencing symptoms of cough, fever and sore throat"
            "recommended": "boolean", // Whether the todo is recommended by the doctor.
            "verified": "boolean" // Whether the todo is verified by the doctor reports. False by default.
        },
        {
            // Sample for type medication. 
            // Keep each medication as a separate todo even if they belong together. Eg, if the doctor recommends starting both Metformin and Glipizide, create 2 separate todos
            // Add the dosage in the title
            "type": "string", 
            "title": "string", // Title of the MEDICATION todo, e.g. "Metformin 500mg", "Glipizide 5mg", "Vitamin D supplement 2000 IU"
            "dosage": "string", // Dosage for the medication, e.g. "500mg", "5mg"
            "frequency": "string", // Frequency of the medication, e.g. "Twice a day", "Every 8 hours",
            "timing": "string", // Timing for the medication, e.g. "Take with meals", "Take on an empty stomach", "Once in the morning and once at night"
            "duration": "string", // Duration for the medication, e.g. "For 2 weeks", "Indefinitely until next follow-up"
            // Description reason and instructions for Medication. Or specific note about it e.g. change from previous dosage, side effect to watch for, reaction with other medication or food.
            // E.g. "Start daily and increase to twice a day after 1 week if no side effects. Watch for signs of low blood sugar such as dizziness, sweating and confusion. Avoid alcohol while on this medication."
            "description": "string", 
            "recommended": "boolean",
            "verified": "boolean"
        },
        {
            // Sample for type procedure. 
            // Keep each procedure as a separate todo even if they belong together. Eg, if the doctor recommends both colonoscopy and endoscopy, create 2 separate todos
            "type": "string",
            "title": "string", // Title of the PROCEDURE todo, e.g. "Colonoscopy", "Knee MRI", "Physical Therapy"
            // Description, Reason and Instructions for the PROCEDURE todo. Also add any details mentioned for it. 
            // E.g. "Patient is over 50 years old.", "Evaluate persistent knee pain and rule out meniscus tear. Avoid strenuous activity until then.", "Improve mobility and strengthen muscles after knee injury. Start in 2 weeks after initial rest and ice treatment."
            "description": "string", 
            "timeframe": "string", // Timeframe for the procedure, e.g. "Within the next month", "As soon as possible", "Within 2 weeks"
            "recommended": "boolean",
            "verified": "boolean"
        },
        {
            // Sample for type CARE. Group care instructions that belong together. Eg, wound care instructions can be grouped together as they are all related to the same care. But if there are different care instructions for different conditions, keep them separate. Eg, care instructions for leg ulcer and care instructions for nasal congestion should be kept as separate todos even if they are given during the same consultation.
            // Care is done by patient themselves or by a caregiver. It is instructions to follow by oneself
            "type": "string",
            "title": "string", // Title of the CARE todo, e.g. "Wound care for leg ulcer", "Saline and Flonase spray for nasal congestion",
            // Description, Reason and Instructions for the CARE todo. Also add any details mentioned for it. 
            // E.g. "Clean the wound with saline and apply antibiotic ointment daily until next follow-up.", "Use saline spray 2-3 times a day and Flonase spray once a day for nasal congestion. Follow up in 1 week if symptoms persist."
            "description": "string", 
            "dosage": "string", // Dosage for the care, e.g. "Apply thin layer to affected area", "Use 1 spray in each nostril", "Apply to scalp and leave on for 5 minutes before rinsing off" - ONLY IF APPLICABLE. If not applicable, leave it out.
            "frequency": "string", // Frequency for the care, e.g. "Daily", "Twice a day", "Every other day" - ONLY IF APPLICABLE. If not applicable, leave it out.
            "timing": "string", // Timing for the care, e.g. "Anytime, twice a day", "Take on an empty stomach", "Once in the morning and once at night" - ONLY IF APPLICABLE. If not applicable, leave it out.
            "duration": "string", // Duration for the care, e.g. "For 2 weeks", "Indefinitely until next follow-up" - ONLY IF APPLICABLE. If not applicable, leave it out.
            "recommended": "boolean",
            "verified": "boolean"
        },
        {
            // Sample for type lifestyle change
            "type": "string",
            "title": "string", // Title of the LIFESTYLE CHANGE todo, e.g. "Adopt DASH Diet", "Start exercising", "Quit smoking"
            // Description, Reason and Instructions for the LIFESTYLE CHANGE todo. Also add any details mentioned for it. 
            // E.g. "Recommend 30 minutes of exercise 5 days a week and a low-sodium diet to help lower blood pressure. Follow up in 1 month to evaluate progress.", "Adopt DASH diet which emphasizes fruits, vegetables, whole grains and lean proteins to help with blood pressure control. Limit sodium intake to less than 1500mg per day.", "Quit smoking to improve lung health and reduce risk of heart disease. Consider nicotine replacement therapy or medications to help with quitting. Seek support from friends, family or support groups."
            "description": "string",
            "recommended": "boolean",
            "verified": "boolean"
        }
    ],
    "follow_up": [
        {
            "time_frame": "string", // Time frame for follow-up, e.g. "In 1 month", "In 3 months", "In 1 year"
            // Description, reason and instructions for follow-up
            // E.g. "Evaluate blood pressure control and adjust medications as needed.", Repeat blood tests to monitor cholesterol levels.", "Annual checkup and preventive care."
            "description": "string" 
        }
    ],
    /* Learnings are concepts or insights given during the consultation. DO NOT invent information, only document what was discussed by the doctor */
    // Learnings can be of type "Concept" or "Insights" - ONLY
    "learnings": [
        {
            // Sample for type concept. Concept is a medical concept, condition or term that the doctor explained during the consultation. E.g. "Hypertension", "Cholesterol", "HbA1c"
            "type": "string", 
            "title": "string", // Title of the concept, e.g. "Hypertension", "Cholesterol", "HbA1c"
            "short_description": "string", // Short description of the concept, e.g. "A condition of persistently high blood pressure", "A waxy substance found in the blood that can increase risk of heart disease when levels are high", "A blood test that measures average blood sugar levels over the past 2-3 months"
            "detailed_description": "string" // Detailed description of the concept, including any specific details mentioned by the doctor during the consultation. E.g. "Hypertension is defined as having a blood pressure reading of 130/80 mmHg or higher. It can increase risk of heart attack, stroke and kidney disease if left uncontrolled. Management includes lifestyle changes and medications.", "Cholesterol is a waxy substance found in the blood that can increase risk of heart disease when levels are high. There are different types of cholesterol, including LDL (bad) cholesterol and HDL (good) cholesterol. Management includes lifestyle changes and medications to help lower LDL cholesterol levels.", "HbA1c is a blood test that measures average blood sugar levels over the past 2-3 months. It is used to diagnose and monitor diabetes. A normal HbA1c level is below 5.7%. A level between 5.7% and 6.4% indicates prediabetes, and a level of 6.5% or higher indicates diabetes."
        },
        {
            // Sample for type insight. 
            // Insight is a SHORT piece of information, observation, recommendation or advice given by the doctor during the consultation. IT HAS to pertain to the patient.
            // It has to be either asked directly by the patient or must be about the patient or related to the patient.
            // It could be a specific response to patient's question, or an advice given by the doctor based on patient's condition etc.
            "type": "string",
            "title": "string", // Title of the insight, e.g. "Importance of blood pressure control", "Use of humidifier for deviated nasal septum", "Effect of deviated septum on snoring"
            "short_description": "string", // Short description of the insight, e.g. "Controlling blood pressure is important to reduce risk of heart attack and stroke.", "Using a humidifier can help with nasal congestion caused by a deviated nasal septum.", "A deviated nasal septum can contribute to snoring and sleep apnea."
            "detailed_description": "string" // Detailed description of the insight, including any specific details mentioned by the doctor during the consultation. E.g. "Controlling blood pressure is important to reduce risk of heart attack and stroke. Lifestyle changes such as regular exercise, a healthy diet and limiting alcohol intake can help with blood pressure control. Medications may also be needed for some patients.", "Using a humidifier can help with nasal congestion caused by a deviated nasal septum. It adds moisture to the air and can help reduce dryness and irritation in the nasal passages. This can be especially helpful during dry winter months or in dry climates.", "A deviated nasal septum can contribute to snoring and sleep apnea by causing obstruction of the airway during sleep. Treatment options for a deviated septum include nasal strips, decongestants, or surgery to correct the deviation."
        }
    ]
}
